org/tools/PostgreSQL.org
#+FILETAGS: :vimwiki:

* PostgreSQL
** Tools - PostgreSQL
# %toc

An adequate definition would be an 'SQL standard implementation, kept
up-to-date'.

*** Feature highlights

**** User-defined data and index types, functional languages
**** Table inheritance
**** A sophisticated locking mechanism
**** Foreign key referential integrity
**** Views, rules, sub-select
**** Nested transactions (savepoints)
**** Multi-version concurrency control
**** Async replication

*** Roles

Managing roles (case-sensitive, the semicolon also matters):
#+begin_example
CREATE ROLE name;
DROP ROLE name;
SELECT rolname FROM pg_roles;
#+end_example

To check existing roles, use `\du`.

**** Role attributes

To be able to login with a role:
#+begin_example
CREATE ROLE name LOGIN;
// equivalent to:
CREATE USER name;
#+end_example

*Superuser status*: bypassess all perm checks except the login right.
Recommendations are similar to those related to being a root user.

#+begin_example
CREATE ROLE name SUPERUSER;
#+end_example

*Role creation*, as well as dropping other roles, managing role membership.
#+begin_example
CREATE ROLE name CREATEROLE;
#+end_example

*Initiating replication*: a role allowed to initiate streaming replication must
 have the `LOGIN` privilege as well.

 #+begin_example
CREATE ROLE name REPLICATION LOGIN;
 #+end_example

*Password*: only significant if the client auth requires it for DB connection.
 DB passwords are separate from OS passwords.

 #+begin_example
CREATE ROLE name PASSWORD 'secret';
 #+end_example

Role's attributes can be modified through `ALTER ROLE`.
#+begin_example
ALTER ROLE name WITH option
#+end_example

    *Tip*: It is good practice to create a role that has the `CREATEDB` and `CREATEROLE`
    privileges, but is not a superuser, and then use this role for all routine
    management of databases and roles. This approach avoids the dangers of operating
    as a superuser for tasks that do not really require it.

*** Tablespaces
Tablespaces define physical locations for database data.

#+begin_example
CREATE TABLESPACE dvdrental LOCATION 'c:\data\dvdrental';
// and then...
ALTER DATABASE dvdrental
SET TABLESPACE dvdrental;
#+end_example

*** Examples

All examples are assuming that the `dvdrental` database (available [[http://www.postgresqltutorial.com/?wpdmact=process&did=MS5ob3RsaW5r][here]] is
imported).

**** SELECT

#+begin_example
SELECT 
    first_name,
    last_name,
    email
FROM customer;
#+end_example

*Distinct*:
Preparation code:
#+begin_example
CREATE TABLE t1 (
    id serial NOT NULL PRIMARY KEY,
        bcolor VARCHAR (25),
        fcolor VARCHAR (25)
    );
INSERT INTO t1 (bcolor, fcolor)
VALUES
    ('red', 'red'),
    ('red', 'red'),
    ('red', NULL),
    (NULL, 'red'),
    ('red', 'green'),
    ('red', 'blue'),
    ('green', 'red'),
    ('green', 'blue'),
    ('green', 'green'),
    ('blue', 'red'),
    ('blue', 'green'),
    ('blue', 'blue');
#+end_example

Multiple values combined to form distinction:
#+begin_example
SELECT DISTINCT
    bcolor,
    fcolor
FROM
    t1
ORDER BY
    bcolor,
    fcolor;
#+end_example

Order by bcolor and fcolor and keep the first row for each duplicate group in 
the result set.
The column taken to `ON` is the distinction criterion.
#+begin_example
SELECT DISTINCT
    ON (bcolor) bcolor,
    fcolor
FROM
    t1
ORDER BY
    bcolor,
    fcolor;
#+end_example

**** LIKE
Works as in MS SQL, pattern matching is worth noting.

#+begin_example
SELECT
    first_name,
        last_name
FROM
    customer
WHERE
    first_name LIKE 'Jen%';
#+end_example

#+begin_example
SELECT
    first_name,
        last_name
FROM
    customer
WHERE
    first_name LIKE '_en__';
#+end_example

***** `%` maches any sequence of characters
***** `_` matches any single character

`ILIKE` is a case insensitive variant of `LIKE`.
One can also use `NOT LIKE` or `NOT ILIKE`.

**** IN
A sensible use case:
#+begin_example
SELECT
    first_name,
    last_name
FROM
    customer
WHERE
    customer_id IN (
        SELECT
            customer_id
        FROM
            rental
        WHERE
            CAST (return_date AS DATE) = '2005-05-27'
    );
#+end_example

**** UNION
Combines result sets of N `SELECT` statements into a single result set.

***** Both queries must return the same number of columns.
