public/tools/PostgreSQL.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 13:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org20ce8a6">1. PostgreSQL</a>
<ul>
<li><a href="#org4dcc0e7">1.1. Tools - PostgreSQL</a>
<ul>
<li><a href="#orgb018b2c">1.1.1. Feature highlights</a>
<ul>
<li><a href="#orgc4df316">1.1.1.1. User-defined data and index types, functional languages</a></li>
<li><a href="#orgccbe63b">1.1.1.2. Table inheritance</a></li>
<li><a href="#orgbd95a49">1.1.1.3. A sophisticated locking mechanism</a></li>
<li><a href="#org61df2d8">1.1.1.4. Foreign key referential integrity</a></li>
<li><a href="#org916c40e">1.1.1.5. Views, rules, sub-select</a></li>
<li><a href="#orga8170eb">1.1.1.6. Nested transactions (savepoints)</a></li>
<li><a href="#org972935c">1.1.1.7. Multi-version concurrency control</a></li>
<li><a href="#orgc3ef4c8">1.1.1.8. Async replication</a></li>
</ul>
</li>
<li><a href="#org2e6ffa0">1.1.2. Roles</a>
<ul>
<li><a href="#org079108f">1.1.2.1. Role attributes</a></li>
</ul>
</li>
<li><a href="#orgf7178a4">1.1.3. Tablespaces</a></li>
<li><a href="#orgef70a49">1.1.4. Examples</a>
<ul>
<li><a href="#orgbc4a518">1.1.4.1. SELECT</a></li>
<li><a href="#org07bdabd">1.1.4.2. LIKE</a></li>
<li><a href="#org4e8b5f4">1.1.4.3. IN</a></li>
<li><a href="#org9e3c7d3">1.1.4.4. UNION</a></li>
<li><a href="#org8e8466a">1.1.4.5. JOIN</a></li>
<li><a href="#orgd8dad13">1.1.4.6. HAVING</a></li>
<li><a href="#orge65124c">1.1.4.7. Subquery</a></li>
<li><a href="#org0410658">1.1.4.8. INSERT</a></li>
<li><a href="#orgc5453a5">1.1.4.9. UPDATE</a></li>
<li><a href="#orge913ab0">1.1.4.10. DELETE</a></li>
</ul>
</li>
<li><a href="#org0d09347">1.1.5. Data types</a>
<ul>
<li><a href="#orgab3f563">1.1.5.1. Character</a></li>
<li><a href="#org669de9b">1.1.5.2. Integer</a></li>
<li><a href="#org6c49b5c">1.1.5.3. Floating-point number</a></li>
<li><a href="#org71359e4">1.1.5.4. Temporal</a></li>
<li><a href="#orgcb24ad7">1.1.5.5. Special</a></li>
</ul>
</li>
<li><a href="#orgedff8ca">1.1.6. Table mgmt</a>
<ul>
<li><a href="#org1f25697">1.1.6.1. CREATE TABLE</a></li>
<li><a href="#org14ff4ed">1.1.6.2. ALTER TABLE</a></li>
<li><a href="#orgbb94865">1.1.6.3. TRUNCATE TABLE</a></li>
</ul>
</li>
<li><a href="#org836d7a6">1.1.7. Database mgmt</a>
<ul>
<li><a href="#org685cf09">1.1.7.1. Restoring a DB</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org20ce8a6" class="outline-2">
<h2 id="org20ce8a6"><span class="section-number-2">1</span> PostgreSQL</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org4dcc0e7" class="outline-3">
<h3 id="org4dcc0e7"><span class="section-number-3">1.1</span> Tools - PostgreSQL</h3>
<div class="outline-text-3" id="text-1-1">
<p>
An adequate definition would be an 'SQL standard implementation, kept
up-to-date'.
</p>
</div>

<div id="outline-container-orgb018b2c" class="outline-4">
<h4 id="orgb018b2c"><span class="section-number-4">1.1.1</span> Feature highlights</h4>
<div class="outline-text-4" id="text-1-1-1">
</div><div id="outline-container-orgc4df316" class="outline-5">
<h5 id="orgc4df316"><span class="section-number-5">1.1.1.1</span> User-defined data and index types, functional languages</h5>
</div>
<div id="outline-container-orgccbe63b" class="outline-5">
<h5 id="orgccbe63b"><span class="section-number-5">1.1.1.2</span> Table inheritance</h5>
</div>
<div id="outline-container-orgbd95a49" class="outline-5">
<h5 id="orgbd95a49"><span class="section-number-5">1.1.1.3</span> A sophisticated locking mechanism</h5>
</div>
<div id="outline-container-org61df2d8" class="outline-5">
<h5 id="org61df2d8"><span class="section-number-5">1.1.1.4</span> Foreign key referential integrity</h5>
</div>
<div id="outline-container-org916c40e" class="outline-5">
<h5 id="org916c40e"><span class="section-number-5">1.1.1.5</span> Views, rules, sub-select</h5>
</div>
<div id="outline-container-orga8170eb" class="outline-5">
<h5 id="orga8170eb"><span class="section-number-5">1.1.1.6</span> Nested transactions (savepoints)</h5>
</div>
<div id="outline-container-org972935c" class="outline-5">
<h5 id="org972935c"><span class="section-number-5">1.1.1.7</span> Multi-version concurrency control</h5>
</div>
<div id="outline-container-orgc3ef4c8" class="outline-5">
<h5 id="orgc3ef4c8"><span class="section-number-5">1.1.1.8</span> Async replication</h5>
</div>
</div>

<div id="outline-container-org2e6ffa0" class="outline-4">
<h4 id="org2e6ffa0"><span class="section-number-4">1.1.2</span> Roles</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Managing roles (case-sensitive, the semicolon also matters):
</p>
<pre class="example">
CREATE ROLE name;
DROP ROLE name;
SELECT rolname FROM pg_roles;
</pre>

<p>
To check existing roles, use `\du`.
</p>
</div>

<div id="outline-container-org079108f" class="outline-5">
<h5 id="org079108f"><span class="section-number-5">1.1.2.1</span> Role attributes</h5>
<div class="outline-text-5" id="text-1-1-2-1">
<p>
To be able to login with a role:
</p>
<pre class="example">
CREATE ROLE name LOGIN;
// equivalent to:
CREATE USER name;
</pre>

<p>
<b>Superuser status</b>: bypassess all perm checks except the login right.
Recommendations are similar to those related to being a root user.
</p>

<pre class="example">
CREATE ROLE name SUPERUSER;
</pre>

<p>
<b>Role creation</b>, as well as dropping other roles, managing role membership.
</p>
<pre class="example">
CREATE ROLE name CREATEROLE;
</pre>

<p>
<b>Initiating replication</b>: a role allowed to initiate streaming replication must
 have the `LOGIN` privilege as well.
</p>

<pre class="example">
CREATE ROLE name REPLICATION LOGIN;
</pre>

<p>
<b>Password</b>: only significant if the client auth requires it for DB connection.
 DB passwords are separate from OS passwords.
</p>

<pre class="example">
CREATE ROLE name PASSWORD 'secret';
</pre>

<p>
Role's attributes can be modified through `ALTER ROLE`.
</p>
<pre class="example">
ALTER ROLE name WITH option
</pre>

<p>
<b>Tip</b>: It is good practice to create a role that has the `CREATEDB` and `CREATEROLE`
privileges, but is not a superuser, and then use this role for all routine
management of databases and roles. This approach avoids the dangers of operating
as a superuser for tasks that do not really require it.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf7178a4" class="outline-4">
<h4 id="orgf7178a4"><span class="section-number-4">1.1.3</span> Tablespaces</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Tablespaces define physical locations for database data.
</p>

<pre class="example">
CREATE TABLESPACE dvdrental LOCATION 'c:\data\dvdrental';
// and then...
ALTER DATABASE dvdrental
SET TABLESPACE dvdrental;
</pre>
</div>
</div>

<div id="outline-container-orgef70a49" class="outline-4">
<h4 id="orgef70a49"><span class="section-number-4">1.1.4</span> Examples</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
All examples are assuming that the `dvdrental` database (available <a href="http://www.postgresqltutorial.com/?wpdmact=process&amp;did=MS5ob3RsaW5r">here</a> is
imported).
</p>
</div>

<div id="outline-container-orgbc4a518" class="outline-5">
<h5 id="orgbc4a518"><span class="section-number-5">1.1.4.1</span> SELECT</h5>
<div class="outline-text-5" id="text-1-1-4-1">
<pre class="example">
SELECT 
    first_name,
    last_name,
    email
FROM customer;
</pre>

<p>
<b>Distinct</b>:
Preparation code:
</p>
<pre class="example">
CREATE TABLE t1 (
    id serial NOT NULL PRIMARY KEY,
        bcolor VARCHAR (25),
        fcolor VARCHAR (25)
    );
INSERT INTO t1 (bcolor, fcolor)
VALUES
    ('red', 'red'),
    ('red', 'red'),
    ('red', NULL),
    (NULL, 'red'),
    ('red', 'green'),
    ('red', 'blue'),
    ('green', 'red'),
    ('green', 'blue'),
    ('green', 'green'),
    ('blue', 'red'),
    ('blue', 'green'),
    ('blue', 'blue');
</pre>

<p>
Multiple values combined to form distinction:
</p>
<pre class="example">
SELECT DISTINCT
    bcolor,
    fcolor
FROM
    t1
ORDER BY
    bcolor,
    fcolor;
</pre>

<p>
Order by bcolor and fcolor and keep the first row for each duplicate group in 
the result set.
The column taken to `ON` is the distinction criterion.
</p>
<pre class="example">
SELECT DISTINCT
    ON (bcolor) bcolor,
    fcolor
FROM
    t1
ORDER BY
    bcolor,
    fcolor;
</pre>
</div>
</div>

<div id="outline-container-org07bdabd" class="outline-5">
<h5 id="org07bdabd"><span class="section-number-5">1.1.4.2</span> LIKE</h5>
<div class="outline-text-5" id="text-1-1-4-2">
<p>
Works as in MS SQL, pattern matching is worth noting.
</p>

<pre class="example">
SELECT
    first_name,
        last_name
FROM
    customer
WHERE
    first_name LIKE 'Jen%';
</pre>

<pre class="example">
SELECT
    first_name,
        last_name
FROM
    customer
WHERE
    first_name LIKE '_en__';
</pre>
</div>

<ol class="org-ol"><li><a id="org3e030d3"></a>`%` maches any sequence of characters<br  /></li>
<li><a id="org0c0555d"></a>`_` matches any single character<br  /><div class="outline-text-6" id="text-1-1-4-2-2">
<p>
`ILIKE` is a case insensitive variant of `LIKE`.
One can also use `NOT LIKE` or `NOT ILIKE`.
</p>
</div></li></ol>
</div>

<div id="outline-container-org4e8b5f4" class="outline-5">
<h5 id="org4e8b5f4"><span class="section-number-5">1.1.4.3</span> IN</h5>
<div class="outline-text-5" id="text-1-1-4-3">
<p>
A sensible use case:
</p>
<pre class="example">
SELECT
    first_name,
    last_name
FROM
    customer
WHERE
    customer_id IN (
        SELECT
            customer_id
        FROM
            rental
        WHERE
            CAST (return_date AS DATE) = '2005-05-27'
    );
</pre>
</div>
</div>

<div id="outline-container-org9e3c7d3" class="outline-5">
<h5 id="org9e3c7d3"><span class="section-number-5">1.1.4.4</span> UNION</h5>
<div class="outline-text-5" id="text-1-1-4-4">
<p>
Combines result sets of N `SELECT` statements into a single result set.
</p>
</div>

<ol class="org-ol"><li><a id="org79ad442"></a>Both queries must return the same number of columns.<br  /></li>
