public/tools/PostgreSQL.html
<li><a id="org46586ac"></a>The corresponding columns in the queries must have compatible data types.<br  /><div class="outline-text-6" id="text-1-1-4-4-2">
<pre class="example">
SELECT *
FROM
    table1
UNION
SELECT *
FROM
    table2;
</pre>

<p>
By default, it removes duplicate rows.
To avoid that, use `UNION ALL`.
</p>

<p>
It's important to remember that when using `ORDER BY` for results of `UNION`,
you can sort each set separately, or sort the whole result set together.
</p>

<pre class="example">
SELECT *
FROM
    table1
UNION ALL
SELECT *
FROM
    table2
ORDER BY
 column1 ASC,
 column2 DESC;
</pre>
</div></li></ol>
</div>

<div id="outline-container-org8e8466a" class="outline-5">
<h5 id="org8e8466a"><span class="section-number-5">1.1.4.5</span> JOIN</h5>
<div class="outline-text-5" id="text-1-1-4-5">
<p>
`INNER JOIN` takes a common result set from the joined sets. Same as in MS SQL.
</p>

<pre class="example">
SELECT
    customer.customer_id,
    customer.first_name customer_first_name,
    customer.last_name customer_last_name,
    customer.email,
    staff.first_name staff_first_name,
    staff.last_name staff_last_name,
    amount,
    payment_date
FROM
    customer
INNER JOIN payment ON payment.customer_id = customer.customer_id
INNER JOIN staff ON payment.staff_id = staff.staff_id;
</pre>

<p>
`LEFT JOIN` is outer for set A and inner for set B.
</p>
<pre class="example">
SELECT
    film.film_id,
    film.title,
    inventory_id
FROM
    film
LEFT JOIN inventory ON inventory.film_id = film.film_id
WHERE
    inventory.film_id IS NULL;
</pre>
</div>
</div>

<div id="outline-container-orgd8dad13" class="outline-5">
<h5 id="orgd8dad13"><span class="section-number-5">1.1.4.6</span> HAVING</h5>
<div class="outline-text-5" id="text-1-1-4-6">
<p>
Can be used to pass additional conditions after a `GROUP BY`.
</p>

<pre class="example">
SELECT
    customer_id,
    SUM (amount)
FROM
    payment
GROUP BY
    customer_id
HAVING
    SUM (amount) &gt; 200;
</pre>
</div>
</div>

<div id="outline-container-orge65124c" class="outline-5">
<h5 id="orge65124c"><span class="section-number-5">1.1.4.7</span> Subquery</h5>
<div class="outline-text-5" id="text-1-1-4-7">
<p>
PostgreSQL executes the query that contains a subquery in the following sequence:
</p>
</div>

<ol class="org-ol"><li><a id="org02c4ef2"></a>Executes the subquery.<br  /></li>
<li><a id="orgbb4c7b2"></a>Gets the result and passes it to the outer query.<br  /></li>
<li><a id="org207b4c6"></a>Executes the outer query.<br  /><div class="outline-text-6" id="text-1-1-4-7-3">
<pre class="example">
SELECT
    film_id,
    title
FROM
    film
WHERE
    film_id IN (
        SELECT
            inventory.film_id
        FROM
            rental
        INNER JOIN inventory ON inventory.inventory_id = rental.inventory_id
        WHERE
            return_date BETWEEN '2005-05-29'
        AND '2005-05-30'
    );
</pre>

<pre class="example">
SELECT
    first_name,
    last_name
FROM
    customer
WHERE
    EXISTS (
        SELECT
            1
        FROM
            payment
        WHERE
            payment.customer_id = customer.customer_id
    );
</pre>
</div></li></ol>
</div>

<div id="outline-container-org0410658" class="outline-5">
<h5 id="org0410658"><span class="section-number-5">1.1.4.8</span> INSERT</h5>
<div class="outline-text-5" id="text-1-1-4-8">
<p>
Multiple rows can be added at a time.
</p>
<pre class="example">
INSERT INTO table (column1, column2, …)
VALUES
    (value1, value2, …),
    (value1, value2, …) ,...;
</pre>

<p>
Also, data from another table can be transferred.
</p>
<pre class="example">
INSERT INTO table(value1,value2,...)
SELECT column1,column2,...
FROM another_table
WHERE condition;
</pre>

<p>
A value from the last inserted row can be returned.
</p>
<pre class="example">
INSERT INTO link (url, NAME, last_update)
VALUES('http://www.postgresql.org','PostgreSQL',DEFAULT) 
RETURNING id;
</pre>
</div>
</div>

<div id="outline-container-orgc5453a5" class="outline-5">
<h5 id="orgc5453a5"><span class="section-number-5">1.1.4.9</span> UPDATE</h5>
<div class="outline-text-5" id="text-1-1-4-9">
<p>
An interesting construct is the `UPDATE JOIN`:
</p>
<pre class="example">
UPDATE link_tmp
SET rel = link.rel,
 description = link.description,
 last_update = link.last_update
FROM
    link
WHERE
    link_tmp.id = link.id;
</pre>
</div>
</div>

<div id="outline-container-orge913ab0" class="outline-5">
<h5 id="orge913ab0"><span class="section-number-5">1.1.4.10</span> DELETE</h5>
<div class="outline-text-5" id="text-1-1-4-10">
<p>
Another tables can be referenced in a `DELETE`:
</p>

<pre class="example">
DELETE FROM table
USING another_table
WHERE table.id = another_table.id AND …
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d09347" class="outline-4">
<h4 id="org0d09347"><span class="section-number-4">1.1.5</span> Data types</h4>
<div class="outline-text-4" id="text-1-1-5">
</div><div id="outline-container-orgab3f563" class="outline-5">
<h5 id="orgab3f563"><span class="section-number-5">1.1.5.1</span> Character</h5>
<div class="outline-text-5" id="text-1-1-5-1">
</div><ol class="org-ol"><li><a id="org8894383"></a>A single character: `char`<br  /></li>
<li><a id="org8c796d2"></a>Fixed-length character strings: `char(n)`. If you insert a string that is shorter than the length of the column, PostgreSQL will pad spaces. If you insert a string that is longer than the length of the column, PostgreSQL will issue an error.<br  /></li>
<li><a id="org2cb7194"></a>Variable-length character strings: `varchar(n)`. You can store up to n characters with variable-length character strings. PostgreSQL does not pad spaces when the stored string is shorter than the length of the column.<br  /></li></ol>
</div>

<div id="outline-container-org669de9b" class="outline-5">
<h5 id="org669de9b"><span class="section-number-5">1.1.5.2</span> Integer</h5>
<div class="outline-text-5" id="text-1-1-5-2">
</div><ol class="org-ol"><li><a id="org2dfe49b"></a>Small integer (`smallint`)  is 2-byte signed integer that has a range of (-32768,32767)<br  /></li>
<li><a id="orgf16b9d5"></a>Integer (`int`) is 4-byte integer that has a range of (-214783648, -214783647)<br  /></li>
<li><a id="orge75c929"></a>`serial` is the same as integer except that PostgreSQL populate value into the column automatically. This is similar to `AUTO<sub>INCREMENT</sub>` attribute in other database management systems.<br  /></li></ol>
</div>

<div id="outline-container-org6c49b5c" class="outline-5">
<h5 id="org6c49b5c"><span class="section-number-5">1.1.5.3</span> Floating-point number</h5>
<div class="outline-text-5" id="text-1-1-5-3">
</div><ol class="org-ol"><li><a id="org839207a"></a>`float(n)`  is a floating-point number whose precision at least n, up to a maximum of 8 bytes.<br  /></li>
<li><a id="org926defb"></a>`real` or `float8` is a double-precision (8-byte) floating-point number.<br  /></li>
<li><a id="org1a6cbda"></a>`numeric` or `numeric(p,s)` is a real number with p digits with s number after decimal point. The `numeric(p,)` is exact number.<br  /></li></ol>
</div>

<div id="outline-container-org71359e4" class="outline-5">
<h5 id="org71359e4"><span class="section-number-5">1.1.5.4</span> Temporal</h5>
<div class="outline-text-5" id="text-1-1-5-4">
</div><ol class="org-ol"><li><a id="org144629c"></a>`date` stores date data<br  /></li>
<li><a id="org9a07a10"></a>`time` stores time data<br  /></li>
<li><a id="org3cfde4d"></a>`timestamp` stores data and time<br  /></li>
<li><a id="orgda68259"></a>`interval` stores the difference in timestamps<br  /></li>
<li><a id="orgcc0286f"></a>`timestamptz` store both timestamp and timezone data. The `timestamptz` is a PostgreSQL’s extension to the temporal data type.<br  /></li></ol>
</div>

<div id="outline-container-orgcb24ad7" class="outline-5">
<h5 id="orgcb24ad7"><span class="section-number-5">1.1.5.5</span> Special</h5>
<div class="outline-text-5" id="text-1-1-5-5">
</div><ol class="org-ol"><li><a id="org7fed367"></a>`box` - a rectangular box.<br  /></li>
<li><a id="orgf985530"></a>`line`  - a set of points.<br  /></li>
<li><a id="orgbffaa3c"></a>`point` - a geometric pair of numbers.<br  /></li>
<li><a id="org6817691"></a>`lseg` - a line segment.<br  /></li>
<li><a id="orge38e6c7"></a>`polygon` - a closed geometric.<br  /></li>
<li><a id="org4c5efdc"></a>`inet` - an IP4 address.<br  /></li>
<li><a id="orge457f5d"></a>`macaddr` - a MAC address.<br  /></li></ol>
</div>
</div>

<div id="outline-container-orgedff8ca" class="outline-4">
<h4 id="orgedff8ca"><span class="section-number-4">1.1.6</span> Table mgmt</h4>
<div class="outline-text-4" id="text-1-1-6">
</div><div id="outline-container-org1f25697" class="outline-5">
<h5 id="org1f25697"><span class="section-number-5">1.1.6.1</span> CREATE TABLE</h5>
<div class="outline-text-5" id="text-1-1-6-1">
<p>
Available column constraints:
</p>
</div>
<ol class="org-ol"><li><a id="orgbff2286"></a>`NOT NULL` - the value of the column cannot be `NULL`.<br  /></li>
<li><a id="org664cd51"></a>`UNIQUE` - the value of the column must be different for each row in the table. However, the column can have many NULL values because PostgreSQL treats each NULL value to be unique. Notice that SQL standard only allows one NULL value in the column that has `UNIQUE` constraint.<br  /></li>
<li><a id="org14840a8"></a>`PRIMARY KEY` - this constraint is the combination of `NOT NULL` and `UNIQUE` constraints. You can define one column as `PRIMARY KEY` by using column-level constraint. In case the primary key has multiple columns, you must use the table-level constraint.<br  /></li>
<li><a id="org9b8dff7"></a>`CHECK` - enables to check a condition when you insert or update data.<br  /></li>
