org/tools/PostgreSQL.org
***** `REFERENCES` - constrains the value of the column that exists in a column in another table.

All of those, except `NOT NULL`, can also serve as table constraints.

**** ALTER TABLE
Noteworthy: instead of `exec SP_RENAME`, the following can be used.
#+begin_example
ALTER TABLE table_name RENAME COLUMN column_name TO new_column_name;
#+end_example

This also applies to tables.

**** TRUNCATE TABLE
This command allows to wipe data from large tables quickly.
#+begin_example
TRUNCATE TABLE table_name;

TRUNCATE TABLE table_name RESET IDENTITY;

TRUNCATE TABLE table_name1, table_name2, …

TRUNCATE TABLE table_name CASCADE;  // also removes data related by foreign keys
#+end_example

*** Database mgmt
**** Restoring a DB
#+begin_example
postgres=# CREATE DATABASE newdvdrental;
#+end_example

and from Bash:
#+begin_example
>pg_restore --dbname=newdvdrental --verbose c:\pgbackup\dvdrental.tar
#+end_example
