public/tools/PostgreSQL.html
<li><a id="org82c0cdd"></a>`REFERENCES` - constrains the value of the column that exists in a column in another table.<br  /><div class="outline-text-6" id="text-1-1-6-1-5">
<p>
All of those, except `NOT NULL`, can also serve as table constraints.
</p>
</div></li></ol>
</div>

<div id="outline-container-org14ff4ed" class="outline-5">
<h5 id="org14ff4ed"><span class="section-number-5">1.1.6.2</span> ALTER TABLE</h5>
<div class="outline-text-5" id="text-1-1-6-2">
<p>
Noteworthy: instead of `exec SP<sub>RENAME</sub>`, the following can be used.
</p>
<pre class="example">
ALTER TABLE table_name RENAME COLUMN column_name TO new_column_name;
</pre>

<p>
This also applies to tables.
</p>
</div>
</div>

<div id="outline-container-orgbb94865" class="outline-5">
<h5 id="orgbb94865"><span class="section-number-5">1.1.6.3</span> TRUNCATE TABLE</h5>
<div class="outline-text-5" id="text-1-1-6-3">
<p>
This command allows to wipe data from large tables quickly.
</p>
<pre class="example">
TRUNCATE TABLE table_name;

TRUNCATE TABLE table_name RESET IDENTITY;

TRUNCATE TABLE table_name1, table_name2, …

TRUNCATE TABLE table_name CASCADE;  // also removes data related by foreign keys
</pre>
</div>
</div>
</div>

<div id="outline-container-org836d7a6" class="outline-4">
<h4 id="org836d7a6"><span class="section-number-4">1.1.7</span> Database mgmt</h4>
<div class="outline-text-4" id="text-1-1-7">
</div><div id="outline-container-org685cf09" class="outline-5">
<h5 id="org685cf09"><span class="section-number-5">1.1.7.1</span> Restoring a DB</h5>
<div class="outline-text-5" id="text-1-1-7-1">
<pre class="example">
postgres=# CREATE DATABASE newdvdrental;
</pre>

<p>
and from Bash:
</p>
<pre class="example">
&gt;pg_restore --dbname=newdvdrental --verbose c:\pgbackup\dvdrental.tar
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
